app/controllers/v1/pet_controller.rb

INSERT INTO "pets" ("user_id", "name", "description", "profile_picture", "birth_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    pet = current_user.pets.new(pet_params)

    pet.set_profile_picture(params[:profilePicture][:src]) if params[:profilePicture][:src].present?

    if params[:pictures].present?
      params[:pictures].each do |pic|
        pet.add_picture(pic[:src])
      end
    end

    if pet.save

SELECT "pets".* FROM "pets" WHERE (name like k) ORDER BY "pets"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE (name like 'p')
---
  def search
    pets = Pet.where("name like ?","%#{params[:search]}%")
    pets = pets.map do |pet|

INSERT INTO "pictures" ("imageable_type", "imageable_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["imageable_type", "Pet"], ["imageable_id", 1], ["image_id", "df11898b-d8f7-4485-bb0a-4f7b16dfd762"], ["created_at", "2021-06-10 03:09:15.541619"], ["updated_at", "2021-06-10 03:09:15.541619"]]
UPDATE "pictures" SET "imageable_id" = ?, "imageable_type" = ? WHERE "pictures"."imageable_id" = ? AND "pictures"."imageable_type" = ? AND "pictures"."id" = ?  [["imageable_id", nil], ["imageable_type", nil], ["imageable_id", 1], ["imageable_type", "Pet"], ["id", 2]]
UPDATE "pets" SET "description" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["description", "ka"], ["updated_at", "2021-06-10 03:16:32.733613"], ["id", 1]]
---
  def update

    if params[:profilePicture].present? && params[:profilePicture][:id] != current_pet.profile_picture
      current_pet.delete_picture_by_id(current_pet.profile_picture)
      current_pet.set_profile_picture(params[:profilePicture][:src])
    end

    if params[:pictures].present?
      pics_ids = params[:pictures].map do |pic|
        if pic[:id].blank?
          current_pet.add_picture(pic[:src])
        end
        pic[:id]
      end

      current_pet.pictures.each do |pic|
        if not pics_ids.include?(pic.image_id)
          current_pet.delete_picture_by_id(pic.image_id)
          current_pet.pictures.delete(pic)
        end
      end
    end
    current_pet.name = pet_params[:name]
    current_pet.description = pet_params[:description]
    current_pet.birth_date = pet_params[:birth_date]
    if current_pet.save

SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ? AND "pets"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def current_pet
    @current_pet ||= current_user.pets.find_by(id: params[:id])