app/controllers/v1/pet_controller.rb

  def current_pet
    @current_pet = current_user.pets.find_by(id: params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ? AND "pets"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]