app/controllers/v1/profile_controller.rb

  def show
    if current_user.profile.present?
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]