app/controllers/v1/province_controller.rb

  def index
    provinces = Province.all.as_json(
      only: [:id, :name]
    )
---
SELECT "provinces".* FROM "provinces"