app/controllers/v1/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."enabled" = ? AND "users"."login" = ? LIMIT ?  [["enabled", 1], ["login", "admin"], ["LIMIT", 1]]
---
  def signin
    user = User.enabled.find_by(login: user_params[:login])

INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "admin"], ["password", "admin12345"], ["created_at", "2021-06-09 21:09:16.369784"], ["updated_at", "2021-06-09 21:09:16.369784"]]
---
  def create
    user = User.new(user_params)

    if user.save