app/models/pet.rb

  def add_picture(image)
    picture_id = SecureRandom.uuid

    $client_redis.set("image_#{picture_id}", image)
    self.pictures << picture_id
---
INSERT INTO "pictures" ("imageable_type", "imageable_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["imageable_type", "Pet"], ["imageable_id", 1], ["image_id", "df11898b-d8f7-4485-bb0a-4f7b16dfd762"], ["created_at", "2021-06-10 03:09:15.541619"], ["updated_at", "2021-06-10 03:09:15.541619"]]