app/models/user.rb

  def add_role(role)
    role = Role.find_by(name: role) if role.instance_of?(String)

    raise "No existe lo que pasaste" if role.blank?

    Permission.create!(user: self, role: role)
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "user"], ["LIMIT", 1]]
INSERT INTO "permissions" ("user_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["role_id", 1], ["created_at", "2021-06-10 03:07:01.874160"], ["updated_at", "2021-06-10 03:07:01.874160"]]

  def self.find_by_token(htoken)
    id = $client_redis.get("session_#{htoken}")

    User.find_by(id: id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]